<?php
$instrumenti = array(
        "zicani" => array(
                "naziv" => "Жичани инструменти",
                "opis" => "Жичани инструменти су музички инструменти код којих се звук производи треперењем његових жица. Музичар може производити звук помоћу прстију, трзалице или гудалом (гудачки инструменти), а други ударањем по струнама лаким дрвеним чекићем. Код неких клавијатурних инструмената, као што је чембало, музичар притисне типку чиме се окида жица. Други музички инструменти производе звук ударањем у жицу."
        ),
        "gudacki" => array(
                "naziv" => "Гудачки инструменти",
                "opis" => "Гудачки инструменти су добили име због начина добијања тона: превлачење гудала преко жице изазива треперење жице и ствара тон. Гудачки инструменти имају четири жица различите дебљине. Најдубље тонове производе презне (недодирнуте) жице, док виши тонови настају њиховим скраћивањем, што се постиже притиском прстију леве руке по жицама. Сви инструменти ове групе су сличне грађе и облика, али различите величине, опсега тонова и боје звука. У ове инструменте спадају: виолина, виолончело, виола и контрабас."
        ),
        "dirke" => array(
                "naziv" => "Инструменти с диркама",
                "opis" => "Инструменти са диркама су група музичких инструмената који користе клавијатуру и њене типке као главни извор звука. Најпознатији инструменти овог типа су клавир, оргуље, електрична клавијатура и други"
        ),
        "udaraljke" => array(
                "naziv" => "Ударачки инструменти",
                "opis" => "Удараљке су по грађи најпримитивнији род музичких инструмената. Од прадавних времена па до данас оне су се јављале у различитим облицима и врстама у народној и уметничкој музици. Звук се добија ударом по звучном извору. Удара се руком (тамбурин), разним врстама палица (тимпани, гонг, звона, ксилофон и други), металном шипком (тријангл) или једном површином о другу (чинели, кастањете), ређе помоћу механизма (челеста)"
        ),
        "duvacki" => array(
                "naziv" => "Дувачки инструменти",
                "opis" => "Дувачки инструменти, како и сам назив каже, су инструменти на којима се тон производи дувањем, обично из уста и плућа свирача. Дувачки инструменти су једна велика и разноврсна породица. Разликују се по облику, материјалу, начину дувања и улози. Они спадају у аерофоне инструменте."
        )
);

	if(empty($_GET["klasa"])) {
		header("location: /");
		exit(0);
	}
	$instrument = $instrumenti[$_GET["klasa"]];
	if(empty($instrument)) {
		header("location: /");
		exit(0);
	}
?>
<!DOCTYPE html>
<html lang="sr">
<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<link rel="shortcut icon" href="./slike/LOGO.ico" type="image/x-icon">
	<link rel="stylesheet" href="./css/global.css">
	<link rel="stylesheet" href="./css/drzava.css">
	<title><?php echo $instrument["naziv"]; ?></title>
</head>
<body>
	<h1><?php echo $instrument["naziv"]; ?></h1>
	<p><?php echo $instrument["opis"]; ?></p>
</body>
</html>